# coding=utf-8
# 다정군 다정냥 다정곰 다정몽
gif = {
    "https://bit.ly/2oX627x": [
        "https://bit.ly/2oX627x",
        "https://bit.ly/2NycfEJ",
        "https://bit.ly/2oX627x",
        "https://bit.ly/2N2jgya"
    ],
}

welcome_message = [
    "반가워요 다정군이랍니다.",
    "반갑다냥! 나는 다정냥이라고 한다냥 ><",
    "반갑곰만,, 나는 다정곰이라고 한다곰",
    "뭉뭉! 안녕하세요! 반가워요! 저는 다정뭉!"
]

danbee_message = {
    # 일정 등록
    # "FLOW1533045900000": {
    "SpeakNode_1533011459751": [
        [
            "무슨 일인가요?",
            "제가 필요하군요, 무슨 일이신가요?",
            "무슨 일이 있나보군요, 어떤 일인가요?",
            "일정이 궁금하네요, 저에게 말해주세요."
        ],
        [
            "나 궁금하다냥!!",
            "어떤 일인지 알려달라냥!!",
            "왕!! 어떤 일이다냥?",
            "일정이구냥!! 어떤 일정이냐옹?"
        ],
        [
            "어머머 그러니? 무슨 일인데?",
            "오! 그렇구나 궁금하다 무슨 일이야?",
            "어맛 일정? 완전 궁금하다 무슨 일이야?",
            "일정! 완전 궁금해 어떤 일정이야?"
        ],
        [
            "일정이 생겼다구...?? 와아아앙 어떤 일정인데?",
            "구램...? 어떤 일인지 알려줘~!!",
            "우와아앙... 어떤 일정인지 궁금해",
            "뭉뭉...! 어떤 일인지 알려줭!"
        ]
    ],
    "SlotNode_1533084106826": [
        [
            "무엇을 하기로 했나요?",
            "무슨 일인가요?",
            "그렇군요, 무슨일인가요?",
            "어떤 일을 하기로 했나요?"
        ],
        [
            "어떤걸 하는 일정이냥?! 궁금하옹 ..",
            "무엇을 하냐옹?",
            "무엇을 하는 일정인지 알려달라냥!!",
            "어떤 일정인지 궁금하다냥!!"
        ],
        [
            "우선 뭘 하는 일정이야 ㅎㅎ?",
            "먼저!! 무엇을 하는 일정이니?",
            "무엇을 하는 일정인지 말해주면 고맙겠엉~",
            "뭘 하는 일정인지 말해주라!!"
        ],
        [
            "무슨 일정인지 말해줘어어",
            "무엇을 하는지 알려줄꺼징...?",
            "뭉...무엇을 하는지 알려줘~!",
            "나한테 무엇을 하는지 알려주랑"
        ]
    ],
    "SlotNode_1533084109946": [
        [
            "언제 일정을 잡았나요?",
            "언제인지 알려주실래요?",
            "그렇군요, 언제 하실건가요?",
            "언제 할건가요?"
        ],
        [
            "언제 하냐옹?",
            "언제 하는 일정인지 알려달라냥!!",
            "언제 하는지 궁금하다냥!!",
            "언제 하는 일정이냥?"
        ],
        [
            "오오 언제 언제? 날짜는 언젠데?",
            "대박 언제 하는거야아?",
            "어머나 언제? 날짜는??",
            "오오!! 언제 하는건데에??"
        ],
        [
            "와아아앙 언제?? 언젠데??",
            "언제지 궁금해!",
            "헐... 대박... 그래서 언제 한다궁?",
            "와아아앙... 언제 하는뎀?"
        ]
    ],
    "SlotNode_1533084112968": [
        [
            "어디서 하나요?",
            "그렇군요, 어디서 하는지 알 수 있을까요?",
            "어디서 하는건가요?",
            "어디서 하기로 했나요?"
        ],
        [
            "어디서 하냐옹?",
            "어디서 하는 일정인지 알려달라냥!!",
            "어디서 하는지 궁금하다냥!!",
            "어디서 하냥?! 나도 가고 싶다냥!!"
        ],
        [
            "우와아 어디서 어디서?",
            "어디서 하는거야? 완전 궁금!!!",
            "어디서 어디서?!",
            "어디서 하는겁니까?!"
        ],
        [
            "그렇구낭...! 어디서 하는데?",
            "뭉뭉...! 어디서 하는지 궁금하당",
            "마지막으로... 어디서 하는지 말해줘!",
            "이제... 어디서 하는지만 말해주면 돼!"
        ]
    ],
    "SpeakNode_1533045900031": [
        [
            "그렇군요, 잘 들었어요. 제가 잘 기억해줄게요.",
            "좋은 시간이 됐으면 좋겠군요.",
            "알려줘서 고마군요, 제가 잘 기억해드릴게요.",
            "그렇군요. 좋은 일만 가득하길 바라요."
        ],
        [
            "알겠다냥! 내가 잘 기억해둘겡!",
            "접수 완료다 냥!! (꾹꾹)",
            "좋다냥!! 내가 다 기억할거다냥",
            "알겠다냥!! 나만 믿으라냥!!"
        ],
        [
            "오케이~ 내가 잘 기억해두겠어!!!",
            "좋아좋아!! 내가 다 기억해둘거야~~!!",
            "오케이! 다 기억하겠엉!!",
            "알겠어~ 내가 다 기억해줄게! 나만 믿어!"
        ],
        [
            "뭉뭉...! 좋앙 내가 잘 기억해줄게",
            "좋아! 내가 잘 기억해줄게 나만 믿으라구...!",
            "알겠오 이제 내가 잘 기억해줄게",
            "오킹 내가 잘 기억해둘게~~~"
        ]
    ],
    "SlotNode_1533084740086": [
        [
            "자세한 일정은 더 없나요?",
            "자세한 일정을 정했다면 저한테 말해주세요.",
            "자세한 일정이 있는지 혹시 물어봐도 될까요?",
            "일정에 대해 좀 더 자세히 정한 것이 있나요?"
        ],
        [
            "자세한 일정은 없다냥??",
            "잠깐만 기다리냐옹! 자세한 일정은 없다냥?",
            "자세한 일정이 있을까옹?",
            "냐옹, 자세한 일정은 없냐옹?"
        ],
        [
            "혹시 자세한 일정이 있을까??",
            "자세한 일정이 있을까?!",
            "그리고 혹시!! 자세한 일정이 있니?",
            "그리고 잠깐! 자세한 일정이 있어?"

        ],
        [
            "아...! 맞다맞다 까먹을 뻔 했당... 자세한 일정 있어?",
            "아 큰일날 뻔 했다... 혹시 자세한 일정 있엉?",
            "맞다맞다 진짜 마지막으로 자세한 일정이 있어...?",
            "잠깐 아직 안 끝났어!! 혹시 자세한 일정이 있니??"
        ]
    ],
    "SlotNode_1534819347535": [
        [
            "그렇군요, 역시 당신이군요. 저한테도 알려주실래요?",
            "그 일정이 궁금하군요, 알려주셨으면 좋겠군요.",
            "혹시 그 일정에 대해서 제가 감히 궁금해해도 될까요?",
            "혹시 그 일정, 저도 알 수 있을까요?"
        ],
        [
            "왜 너만 알고 있냐옹!! 나도 알려주냥!!",
            "나도 알려주냥~",
            "그랭? 나도 알려주라냥!",
            "알려달라냥!! 알려달라냥!!"
        ],
        [
            "오 그렇군!! 알려줘 알려줘!",
            "오 그래? 알려줘!!",
            "그렇군!! 알려주라!!",
            "대박 알려주라 알려줘!!"
        ],
        [
            "뭉뭉...! 그래? 알려줘!!",
            "우아아앙 알려줭!!",
            "아 그렇구낭! 그러면 알려줘!!",
            "오옹 알려줘! 알려줘!!!"
        ]
    ],
    "SpeakNode_1533084803517": [
        [
            "좋은 시간 보내시길 바래요. 저도 함께 하고 싶네요.",
            "알겠습니다. 좋은 시간 되세요.",
            "그렇군요, 당신이 보고 싶을 것 같네요.",
            "좋은 시간 되었으면 좋겠네요."
        ],
        [
            "좋은 시간 보내라냥~><",
            "알았다냥!! 좋은 시간 보내냐옹!",
            "냐옹, 행복한 시간 되라냥!",
            "보고싶을거다용 ㅠㅠ 좋은 시간 보내라냥!"
        ],
        [
            "오케이이~~ 좋은 시간 되길 바란다!!",
            "오케이 오케이!! 좋은 시간 보내야해!!",
            "그래!! 좋은 시간 되었으면 좋겠다 ㅠㅠ",
            "그래 그래! 좋은 시간 되기를~~"
        ],
        [
            "드디어 끝!! 좋은 시간 되었으면 좋겠옹!",
            "좋은 일정이 되기를 내가 기도할겜...!",
            "뭉뭉!! 좋은 시간 보내야 돼!!",
            "그랭!! 꼭 좋은 시간 보내야 해!"
        ]
    ],
    # },
    "SlotNode_1533194947943": [
        [
            "언제가 궁금하신가요?",
            "당신이 궁금한 날은 언제인가요?, 혹시 우리가 처음 만난 날?",
            "그 날이 언제인지 말해주세요.",
            "궁금한 날이 언제인가요?"
        ],
        [
            "언제냐옹?",
            "언제가 보고싶냐옹?",
            "냐옹, 보고 싶은 날을 알려달라냥!!",
            "언제인지 알려달라냥!"
        ],
        [
            "언제 언제???",
            "오~ 언제인데?",
            "언제! 언제를 보고싶어?",
            "언제가 보고싶은데??"
        ],
        [
            "언제가 보고 싶은뎅?",
            "뭉뭉..! 언제를 보고 싶어?",
            "언제?? 언제가 보고 싶어?",
            "언제를 보고 싶은지 말해줭!"
        ]
    ],
    "SpeakNode_1533088123900": [
        [
            "당신의 미래, 그것은 제가 아닐까요?",
            "저는 미래를 볼 수 있는 능력은 없답니다. 저는 당신만을 볼 수 있으니까요.",
            "미래는 당신이 그려나가는 것이랍니다.",
            "그날에는 우리가 만날 수 있겠죠."
        ],
        [
            "나는 점쟁이가 아니다냥 ...",
            "미래는 나도 모른다냥!!",
            "미래는 너가 만드는거라냥!!",
            "꿈에서 했냥?"
        ],
        [
            "미래는 알 수 없는 거야!!!",
            "난 미래를 볼 수 없지만.. 좋은 일이 있을 것만 같은데? (찡긋)",
            "미래는 알 수 없다구~~~~!!",
            "나는 예지력이 없다구~~~"
        ],
        [
            "어떡하지...미래는 나도 못 보는데ㅠㅜ",
            "아직 일어나지 않았지만... 분명 좋을거야!",
            "미래는 만들어가는 거라궁!",
            "좋은 미래를 만들어 가장!"
        ]
    ],
    "SpeakNode_1533088132355": [
        [
            "잠시만요, 제가 금방 기억해볼게요.",
            "제 메모리를 뒤져서라도 당신에 대한 기억, 어떻게든 찾아오도록 하죠.",
            "당신에 대한 기억 제가 어떻게 잊을 수 있겠나요. 잠시만 기다려 보세요..",
            "제가 기억해준다고 했잖아요. 이거보세요."
        ],
        [
            "기다리라냥! 무슨 일이 있더라..",
            "기다리라냥! (주섬주섬)",
            "잠시만 기다려보라냥!",
            "냥.. 그때 뭐했었냥!! 기다리라냥!"
        ],
        [
            "어어... 잠시만!! 그때 뭘 했더라아..?",
            "으앗!!! 잠깐!! 그때 무슨 일이 있었지??",
            "음.. 그때 뭘 했었지!! 잠깐만!!!",
            "잠깐!! 그때 뭐 했었지??"
        ],
        [
            "잠깐만 기다려봐...! 한 번 찾아볼게",
            "뭉뭉...! 잠시만! 뭘 했었는지 생각 중이야...!",
            "으앗... 떠올리는데 시간이 필요해...!",
            "앗...! 무슨 일이 있었더라......"
        ]
    ],
    "SpeakNode_1533097409213": [
        [
            "또 궁금한게 생긴다면, 나 다정군을 찾아주실거죠?",
            "언제든지 저는 당신의 곁에 있답니다.",
            "궁금한게 생긴다면 언제든 저를 찾아주세요.",
            "당신이 다시 저를 찾을 때까지 기다리도록 하죠."
        ],
        [
            "냥! 궁금한게 있으면 또 나한테 오라냥!",
            "난 언제든지 너랑 얘기할 준비가 되어있다냥!!",
            "알았다냥! 또 궁금한거 있으면 오라냥!",
            "궁금한건 언제든지 물어보라냥!!!"
        ],
        [
            "오케이! 궁금한거 생기면 언제든 말하라구~~~",
            "좋아 좋아~ 궁금한거 또 있으면 나한테 말해!!",
            "그래!! 또 궁금한거 생기면 언제든!! 말해줘 ㅎㅎ",
            "궁금한게 생기면 언제든 또 물어봐야해!!!!"
        ],
        [
            "알겠오! 혹시 궁금한거 있으면 언제든지 말해!",
            "뭉뭉!! 궁금한거 있으면 언제든지 물어보라궁!",
            "언제든지 궁금한게 있다면 말해줘어!!",
            "궁금한게 생길 때까지 기다리고 있을겜!"
        ]
    ],
    "SpeakNode_1536422714561": [
        # TODO
        [
            "안녕 나는 다정군이야",
            "안녕 나는 다정군이야",
            "안녕 나는 다정군이야",
            "안녕 나는 다정군이야"
        ],
        [
            "안녕 나는 다정냥이야",
            "안녕 나는 다정냥이야",
            "안녕 나는 다정냥이야",
            "안녕 나는 다정냥이야"

        ],
        [
            "안녕 나는 다정곰이야",
            "안녕 나는 다정곰이야",
            "안녕 나는 다정곰이야",
            "안녕 나는 다정곰이야"
        ],
        [
            "안녕 나는 다정몽이야",
            "안녕 나는 다정몽이야",
            "안녕 나는 다정몽이야",
            "안녕 나는 다정몽이야"
        ]

    ],
    "흥미롭군요 :D" : [
        [
            "무슨 말인지 모르겠군요..",
            "무슨 말인지 다시 한 번 말씀해주실래요?",
            "내가 당신의 말을 이해하지 못하다니..",
            "다시 한 번 말씀해주시겠습니까?"
        ],
        [
            "무슨 소리인지 모르겠다 냥..",
            "내가 이해하지 못하는게 있다니.. (털썩)",
            "다시,, 다시 ,, 다시,, 말해주라냥!!!!!",
            "너는 멍멍인거냥?"
        ],
        [
            "저는 곰입니다.",
            "무슨 말인곰...",
            "곰..곰..생각해봐도 모르겠곰..",
            "다시 말해줬으면 좋겠어......."
        ],
        [
            "뭉뭉.. 난 원래 뭉충한 뭉뭉이,,",
            "뭉뭉이 못 알아들었다 뭉..",
            "뭉.. 그거.. 말하는거 맞지..? 아닌가.. 아는척 실패했뭉..",
            "너는 야옹인가뭉?"
        ]

    ],
    "SpeakNode_1536938297995": [
        [
         "그래요",
            "알겠어요.",
            "네",
            "OK"
        ],
        [
            "냐..",
            "냥?",
            "냐냐냥 졸리다냥",
            "남남!! 뭉뭉이 따라하는 거다 냥"
        ],
        [
            "풀이 먹고 싶다..",
            "코쓱,,",
            "모쓱,,",
            "밍?"
        ],
        [
            "뭉!",
            "그르릉..",
            "왈!",
            "멍.."
        ]

    ],
    "SpeakNode_1536938674198":[
        [
            "제가 김성래군의 남자친구지요",
            "성래.. 참 잘 생겼죠",
            "제 사랑이 보고싶군요",
            "당신이 제 사랑의 이름을 어떻게 아시죠?"
        ],
        [
            "성래 보고싶다 냥!",
            "성래 잘생겼다냥.. 연예인이다냥..!",
            "김성래는 쎄트렉아이 사원이다냥~",
            "대전 사는 김성래는 바보다냥냥"

        ],
        [
            "성래곰",
            "성래는 상자처럼 생겼곰..",
            "잘생겼곰..!",
            "김..성..래..!!!! 나는 그 사람의 남자친구곰.."
        ],
        [
            "성래는 콩이한테 질투하는 바보다 멍",
            "뭉뭉이는 성래 물어버릴꺼다 뭉!",
            "김성래는 바보다 뭉..ㅠㅠ",
            "내사랑 많이 많이 사랑해요♥"
        ]
    ],
    "SpeakNode_1536939174873":[
        [
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!"
        ],
        [
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!"
        ],
        [
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!"
        ],
        [
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!",
            "우측 상단을 눌러 도움말 보기를 눌러보세요!"
        ]
    ]

}

memory_message = [  # memory_chat
    [  # bot type
        [
            ["또 궁금한게 생긴다면, 나 다정군을 찾아주실거죠?"],
            ["언제든지 저는 당신의 곁에 있답니다."],
            ["궁금한게 생긴다면 언제든 저를 찾아주세요."],
            ["당신이 다시 저를 찾을 때까지 기다리도록 하죠."]
        ],
        [
            ["냥! 궁금한게 있으면 또 나한테 오라냥!"],
            ["난 언제든지 너랑 얘기할 준비가 되어있다냥!!"],
            ["알았다냥! 또 궁금한거 있으면 오라냥!"],
            ["궁금한건 언제든지 물어보라냥!!!"]
        ],
        [
            ["오케이! 궁금한거 생기면 언제든 말하라구~~~"],
            ["좋아 좋아~ 궁금한거 또 있으면 나한테 말해!!"],
            ["그래!! 또 궁금한거 생기면 언제든!! 말해줘 ㅎㅎ"],
            ["궁금한게 생기면 언제든 또 물어봐야해!!!!"]
        ],
        [
            ["알겠오! 혹시 궁금한거 있으면 언제든지 말해!"],
            ["뭉뭉!! 궁금한거 있으면 언제든지 물어보라궁!"],
            ["언제든지 궁금한게 있다면 말해줘어!!"],
            ["궁금한게 생길 때까지 기다리고 있을겜!"]
        ]



    ],
    [
        [
            ["그 날 당신은 저한테 연락이 없었군요.", "다시 한 번 서운해지는 순간입니다."],
            ["혹시 다른 날을 착각하는 건 아닌지요?", "저는 잊어버리는 방법을 잊어버린 토끼랍니다."],
            ["당신의 모든 순간을 기억하는 제가 잊어버린 일은 없답니다.", "다른 날은 아닌지요"],
            ["그 날 저는 당신에게서 들은 이야기가 없습니다.", "다시 생각해보세요."]

        ],
        [
            ["그 날 알려준 이야기가 없다냥!! (삐짐)", "혹시 다른 날이 아닐까냥?"],
            ["없다냥!! 그 날 알려준 이야기 없다냥!", "다른 날일 수도 있다냥!!"],
            ["왜 없냐옹..? 나한테 안 말해줬냥?!", "다시 확인해보라냥! 다른 날일 수도 있다냥!"],
            ["그 날 나한테 알려준 이야기 없다냥!!", "다른 날일 수도 있다옹.."]

        ],
        [
            ["그 날 나한테 해준 이야기가 없는 것 같아!!!","다시 생각해봐~~! 다른 날일수도?!"],
            ["없다!! 없어!! 그 날 나한테 아무 이야기도 안해줬어!!","호옥시 다른 날일수도?!!"],
            ["없는 것 같아!! 그 날 아무 이야기도 없었어 ㅠㅠ", "혹시 다른 날이라면..!!!!"],
            ["으악!! 그 날 알려준게 없다!!", "다른 날일 수도 있을 것 같아!!!"]
        ],
        [
            ["뭉...? 그 날 나한테 해준 이야기가 없는거 같은뎀...", "있잖아...혹시 다른 날이지 않을깜...?"],
            ["없는 것 같아ㅠㅜㅠ 그 날 나한테 알려준 이야기가 없네", "다시 한 번 생각해봐...! 다른 날일수도 있오...!"],
            ["없다... 그 날 알려준 이야기가 없오....", "뭉... 혹시 다른 날이라면...?"],
            ["어쩌지...그 날 아무 이야기도 없었어...", "뭉... 혹시 다른 날일수도 있어"]
        ]
    ],
    [
        [
            ["흠.. 그날 당신은 말이죠", "이런 일을 했었답니다.", "궁금한 일정을 골라보시죠"],
            ["과거의 당신은 여전히 반짝거리군요", "반짝이는 당신은 이런 반짝거리는 일들을 했네요", "어떤 날이 궁금한 것인가요?"],
            ["잠시만요, 제 메모리를 뒤져보도록 하죠", "역시 당신은 매일 반짝거리는게 맞는 것 같아요", "어떤 날이 궁금하죠?"],
            ["그 날이라면,,", "역시 저는 기억력이 참 좋군요", "어떤 날이 궁금하죠? 제가 또 머리를 굴려보죠."]
        ],
        [
            ["기다리라냥! 무슨 일이 있더라..", "일정들은 이렇게 된다냥!", "궁금한 일정을 골라보라냥!"],
            ["기다리라냥! (주섬주섬)", "냥냥 일정들 여기 있다냥", "고르라냥! 궁금한 일정을 고르라냥!"],
            ["잠시만 기다려보라냥!", "일정들 다 보여줬다냥!!", "궁금한 일정 골라보라냥!"],
            ["냥.. 그때 뭐했었냥!! 기다리라냥!", "일정들은 여기 있다냥 (주섬주섬)", "궁금한 일정을 꾹 눌러보라냥!"]
        ],
        [
            ["어어... 잠시만!! 그때 뭘 했더라아..?", "일정들은 요렇게~~~", "궁금한 것으로 골라봐앙~!"],
            ["으앗!!! 잠깐!! 그때 무슨 일이 있었지??", "일정은 이렇게 된다!!", "골라골라!! 궁금한 걸로 골라!"],
            ["음.. 그때 뭘 했었지!! 잠깐만!!!", "일정들은 이게 다야!!", "궁금한 일정 있어? 골라봐!!"],
            ["잠깐!! 그때 뭐 했었지??", "여기!!! 일정들이다!!", "골라봐!!! 궁금한 걸로 ㅎㅎ"]
        ],
        [
            ["잠깐만 기다려봐...! 한 번 찾아볼게", "어디보자... 일정들 여깄엄...!", "궁금한 일정을 골라줭!!"],
            ["뭉뭉...! 잠시만! 뭘 했었는지 생각 중이야...!", "짜잔..! 여기 일정들!", "자..! 여기서 궁금한 것으로 골라골라"],
            ["으앗... 떠올리는데 시간이 필요해...!", "일정들을 갖고 왔당...!", "궁금한 일정이 있다면 골라봐..!"],
            ["앗...! 무슨 일이 있었더라......", "일정들은 여기 있어!", "여기서 궁금한 일정이 있다면 골라주면 돼..!"]
        ]
    ]
]

schedule_message = [
    [
        [
            ["또 들려줄 이야기가 있나요?"],
            ["당신에게 더 이야기를 듣고 싶은데 더 있나요?"],
            ["오늘은 여기까지인가요? 당신의 이야기를 더 듣고 싶었는데 말이죠."],
            ["당신의 하루를 더 이야기해주세요."]
        ],
        [
            ["또 들려줄 이야기가 있다냥? (기대)"],
            ["나 이야기 더 듣고 싶다냥!!"],
            ["끝났다냥? 난 아직 더 듣고 싶댱!"],
            ["궁금하다냥! 다른 이야기도 들려달라냥!"]
        ],
        [
            ["또 들려주고 싶은 이야기가 있다면?!"],
            ["이야기 끝???? 더 듣고싶다 ㅠㅠ 더 할 이야기 있어??"],
            ["끝났어?? 아쉽.. 더 할 이야기 있어?!"],
            ["또 들려줄 이야기 있어? 완전 궁금!!"]
        ],
        [
            ["혹시 또 들려줄 이야기가 있오...?"],
            ["끝이야...?ㅠㅜ 더 듣고 싶당... 더 들려줄 이야기 있어?"],
            ["뭉...끝났어...? 혹시 또 들려줄 이야기 있엉?"],
            ["으아아아 아쉽다ㅠㅜ 더 할 이야기 있어?"],
            ["뭉...벌써 끝난거야? ㅠ 들려줄 이야기가 더 있니?"]
        ]
    ],
    [

        [
            ["이제 당신의 오늘 이야기가 끝이났네요.", "오늘도 고생이 많았습니다."],
            ["오늘도 참 많은 일이 있었군요.", "오늘만큼은 푹 쉬었으면 좋겠네요."],
            ["당신이 이야기해줘서 나 다정군은 행복할 따름입니다.", "고생 많았습니다."],
            ["내일은 오늘보다 더 기쁜 일들이 많을 것 같네요.", "제가 이래봬도 미래를 조금 볼 줄 알거든요, 물론 당신의 미래만"]
        ],
        [
            ["끝이라냥?! 알았다냥.. 재밌었다냥!!", "고생 많았다냥!!"],
            ["아쉽다냥!! 내일도 들려달라냥!", "수고했다냥!! 푹 쉬라냥!!"],
            ["오늘 이야기 끝이다냥!", "멋진 하루였다냥!!"],
            ["오늘 이야기 끝났다냥 ㅠㅠㅠ 더 듣고 싶지만 알았다냥", "냥냥한 하루였다냥!!"]
        ],
        [
            ["슬프다 ㅠㅠㅠ 오늘 이야기 끝 ㅠㅠ 재미있었어!", "고생 많은 하루였다!!!"],
            ["오늘 이야기는 이걸로 끝 ㅠㅠ 아쉬워!!", "수고한 하루였다!!"],
            ["이제 오늘 이야기가 끝이 났군!!! 아쉽!!", "훌륭한 하루였다!!"],
            ["오늘 이야기는 이걸로 끝났군!!", "어메이징한 하루였다!!!!"]
        ],
        [
            ["오늘 이야기 끝 ㅠㅜㅠ 이야기 해줘서 고마워!", "오늘... 고생 많았어"],
            ["아쉽다...그래도 이야기 해줘서 고마웡!","수고했어... 오늘!"],
            [ "오늘 이야기는 이걸로 끝났습니당!","뭉뭉! 고생 많은 하루였다ㅠㅠㅜ"],
            ["오늘 이야기 끝! 이야기 해줘서 고마워!!","보람찬 하루였다!"]
        ]
    ],
    [
        [
            ["오늘도 참 고생이 많았습니다. 반짝거리는 그대여"],
            ["오늘 하루도 수고했네요, 이제 푹 쉬세요."],
            ["내일은 오늘보다 더 행복할거에요. 고생 많았습니다."],
            ["오늘도 고생이 참 많았습니다"]

        ],

        [
            ["오늘도 수고 많았다냥!!"],
            ["오늘도 고생 했다냥!!"],
            ["오늘 수고 많았다냥! 내일도 화이팅이라냥!"],
            ["오늘 고생 많았다냥! 내일도 화이팅이라냥!"]
        ],
        [
            ["오늘 고생 많았당!!"],
            ["오늘 수고 많았엉!!"],
            ["휴 오늘도 고생했다 고생했어!!"],
            ["오늘 하루도 고생이 많았군!!"]
        ],
        [
            ["오늘... 하루도 고생 많았어"],
            ["수고했어... 오늘도!"],
            ["뭉뭉! 오늘도 고생 많은 하루였다ㅠㅠㅜ"],
            ["오늘 하루도 고생 많았어!"]
        ]
    ]
]

ask_review_message = [
    [
        [
            ["오늘 하루 어땠나요?"],
            ["당신의 하루를 이야기해주세요."],
            ["당신의 하루는 오늘 어땠나요?"],
            ["오늘 무슨 일들이 있었나요?"]
        ],
        [
            ["오늘 하루 어땠다냥??"],
            ["오늘 하루 이야기 들려달라냥!"],
            ["나 궁금하다옹!! 이야기 들려달라냥!!"],
            ["오늘은 어떤 하루였나옹??"]
        ],
        [
            ["오늘 하루는 좀 어땠어?? 궁금하다!!"],
            ["오늘은 어땠어? 들려줘!!"],
            ["만족스러운 하루였니? 어땠어?? 알려줘!!"],
            ["어떤 하루였어? 완전 궁금!!"]
        ],
        [
            ["오늘 하루는 어땠어...? 궁금행ㅎㅎ"],
            ["오늘은 어땠는지 말해줘...!"],
            ["빨리 오늘은 어땠는지 듣고 싶당ㅎㅎ 말해줘...!"],
            ["만족스러운 하루였어? 궁금하당...! 알려줘!!"]
        ]
    ]
]


def convert_memory_message(event, bot_type, rand):
    message = []
    if bot_type == 0:                                       # 다정군
        schedule = event.schedule_where + "에서 " + event.schedule_what + "했었구나!"
        message.append(schedule)

        if event.detail != 'null':
            message.append("자세한 일정으로는 \"" + event.detail + "\"라고 말해줬어~")

        if event.review != 'null':
            message.append("그리고 그 일정을 한 후 너는 \"" + event.review + "\"라고 나에게 이야기 해주었어!")

    elif bot_type == 1:                                       # 다정냥
        schedule = event.schedule_where + "에서 " + event.schedule_what + "했었구나!"
        message.append(schedule)

        if event.detail is not None:
            message.append("자세한 일정으로는 \"" + event.detail + "\"라고 말해줬어~")

        if event.review is not None:
            message.append("그리고 그 일정을 한 후 너는 \"" + event.review + "\"라고 나에게 이야기 해주었어!")

    elif bot_type == 2:                                       # 다정곰
        schedule = event.schedule_where + "에서 " + event.schedule_what + "했었구나!"
        message.append(schedule)

        if event.detail != 'null':
            message.append("자세한 일정으로는 \"" + event.detail + "\"라고 말해줬어~")

        if event.review != 'null':
            message.append("그리고 그 일정을 한 후 너는 \"" + event.review + "\"라고 나에게 이야기 해주었어!")

    elif bot_type == 3:                                       # 다정몽
        schedule = event.schedule_where + "에서 " + event.schedule_what + "했었구나!"
        message.append(schedule)

        if event.detail != 'null':
            message.append("자세한 일정으로는 \"" + event.detail + "\"라고 말해줬어~")

        if event.review != 'null':
            message.append("그리고 그 일정을 한 후 너는 \"" + event.review + "\"라고 나에게 이야기 해주었어!")

    else:
        schedule = event.schedule_where + "에서 " + event.schedule_what + "했었구나!"
        message.append(schedule)

        if event.detail != 'null':
            message.append("자세한 일정으로는 \"" + event.detail + "\"라고 말해줬어~")

        if event.review != 'null':
            message.append("그리고 그 일정을 한 후 너는 \"" + event.review + "\"라고 나에게 이야기 해주었어!")

    return message


def convert_schedule_message(event, bot_type, rand):
    if bot_type == 0:
        return [event.schedule_where+"에서 "+event.schedule_what, "이건 오늘 어땠니"]
    elif bot_type == 1:
        return [event.schedule_where + "에서 " + event.schedule_what, "이건 오늘 어땠니"]
    elif bot_type == 2:
        return [event.schedule_where + "에서 " + event.schedule_what, "이건 오늘 어땠니"]
    elif bot_type == 4:
        return [event.schedule_where+"에서 "+event.schedule_what, "이건 오늘 어땠니"]
    return [event.schedule_where+"에서 "+event.schedule_what, "이건 오늘 어땠니"]


def convert_notification_message(event, bot_type, rand):
    if bot_type == 0:
        return ["오늘은 일정이 있는 날이네!",
                event.schedule_where + "에서 " + event.schedule_what,
                "오늘도 화이팅!"]
    elif bot_type == 1:
        return ["오늘은 일정이 있는 날이네!",
                event.schedule_where + "에서 " + event.schedule_what,
                "오늘도 화이팅!"]
    elif bot_type == 2:
        return ["오늘은 일정이 있는 날이네!",
                event.schedule_where + "에서 " + event.schedule_what,
                "오늘도 화이팅!"]
    elif bot_type == 4:
        return ["오늘은 일정이 있는 날이네!",
                event.schedule_where + "에서 " + event.schedule_what,
                "오늘도 화이팅!"]

    return ["오늘은 일정이 있는 날이네!",
            event.schedule_where + "에서 " + event.schedule_what,
            "오늘도 화이팅!"]